<a href="https://colab.research.google.com/github/2303A51629/B22_1629/blob/main/pandas_29_08_25.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [19]:
import pandas as pd
#create a series from list
data = [10,20,30,40,50]
series = pd.Series(data)
print("pandsa Series:")
print(series)

pandsa Series:
0    10
1    20
2    30
3    40
4    50
dtype: int64

In [3]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print(series)

a    10
b    20
c    30
d    40
e    50
dtype: int64

In [4]:
import pandas as pd
data={ 'Name':['Alice','Bob','Charlie','David'],'Age':[25,30,35,40],'city':['New York','San Francisco','Los Angeles','Chicago']}
df=pd.DataFrame(data)
print(df)

      Name  Age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [5]:
#basic Data frame operations
#Accessing a sinlge column
print(df['Name'])

0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

In [9]:
#accesss rows using index
print(df.iloc[1])
print(df.loc[2])

Name              Bob
Age                30
city    San Francisco
Name: 1, dtype: object
Name        Charlie
Age              35
city    Los Angeles
Name: 2, dtype: object

In [10]:
#adding a new column
df['Salary']=[50000,60000,70000,80000]
print(df)

      Name  Age           city  Salary
0    Alice   25       New York   50000
1      Bob   30  San Francisco   60000
2  Charlie   35    Los Angeles   70000
3    David   40        Chicago   80000

In [11]:
#REmoving a column
df=df.drop('Salary',axis=1)
print(df)

      Name  Age           city
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   40        Chicago

In [12]:
#Filtering data
#select rows where age>30
print(df[df['Age']>30])

      Name  Age         city
2  Charlie   35  Los Angeles
3    David   40      Chicago

In [13]:
#Basic Statistics
print(df['Age'].mean())
print(df['Age'].max())
print(df['Age'].min())

32.5
40
25

In [14]:
#create a dataFrame with student details
student_data={'student_id':[101,102,103,104],'Name':['Ravi','Neha','kiran','sita'],'Marks':[85,90,78,92],'Department':['CSE,ECE','CSE','ECE','CSE']}
df=pd.DataFrame(student_data)
print(df)

   student_id   Name  Marks Department
0         101   Ravi     85    CSE,ECE
1         102   Neha     90        CSE
2         103  kiran     78        ECE
3         104   sita     92        CSE

In [15]:
#find students with marks>80
print(df[df['Marks']>80])

   student_id  Name  Marks Department
0         101  Ravi     85    CSE,ECE
1         102  Neha     90        CSE
3         104  sita     92        CSE

In [16]:
#average marks
print(df['Marks'].mean())

86.25

In [17]:
#add  new column
df['Grade']=['A','B','C','A']
print(df)

   student_id   Name  Marks Department Grade
0         101   Ravi     85    CSE,ECE     A
1         102   Neha     90        CSE     B
2         103  kiran     78        ECE     C
3         104   sita     92        CSE     A

In [18]:
stu_data={
    'stu_name':['teju','keerthi','sindhu','shailaja','sanjana'],
    'stu_rollno':[1,2,3,4,5],
    'M1':[90,82,92,95,91],
    'M2':[92,81,92,96,95],
    'M3':[93,85,95,92,97],
}

df = pd.DataFrame(stu_data)

total=df['M1']+df['M2']+df['M3']
df['total']=total

result=['pass' if total>=270 else 'fail' for total in df['total']]
df['result']=result

avg=df['total']/3
df['average']=avg

print(df)

   stu_name  stu_rollno  M1  M2  M3  total result    average
0      teju           1  90  92  93    275   pass  91.666667
1   keerthi           2  82  81  85    248   fail  82.666667
2    sindhu           3  92  92  95    279   pass  93.000000
3  shailaja           4  95  96  92    283   pass  94.333333
4   sanjana           5  91  95  97    283   pass  94.333333